{
  "backend/main.mo": "Main canister implementing access control, user profiles, attendance records, holiday and permission requests using ordered maps and role checks.",
  "feature_evidence.json": "Feature evidence report listing implemented translation, localization, and domain‑label features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and Italian‑localized behavior of each frontend component and utility file.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root component handling authentication, invite flow, onboarding, profile setup, and rendering the dashboard with Italian i18n.",
  "frontend/src/components/Header.tsx": "Header component with theme toggle, user menu, logout handling, and Italian‑localized labels.",
  "frontend/src/components/HolidayApprovals.tsx": "Admin interface for viewing, filtering, and approving or rejecting holiday requests with Italian status labels.",
  "frontend/src/components/InviteManagement.tsx": "Manages invite code generation, copying, and displays statistics and tables for unused, used, and RSVP-related codes.",
  "frontend/src/components/MyAttendance.tsx": "Provides UI for recording, editing, and viewing personal attendance records with multiple time views and activity types.",
  "frontend/src/components/MyHolidays.tsx": "Lets users submit holiday requests, view monthly filtered requests, and shows remaining holiday balance.",
  "frontend/src/components/MyPermissions.tsx": "Handles creation and listing of permission requests with date selection, request types, and status badges.",
  "frontend/src/components/OnboardingFlow.tsx": "Guides new users through RSVP submission and profile setup using an invite code across a multi‑step onboarding flow.",
  "frontend/src/components/PermissionApprovals.tsx": "Displays and filters permission requests, allowing admins to approve or reject them with status badges and counters.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for creating a user profile with name, position, and role, saving data through a mutation.",
  "frontend/src/components/TeamOverview.tsx": "Shows team attendance data by day, week, or month with statistics, navigation, and CSV export options.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and logout logic using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating profiles, attendance, permissions, and related backend data.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies base border and background/text styles.",
  "frontend/src/lib/attendanceLabels.ts": "Provides deprecated wrappers forwarding attendance and activity label helpers to domainLabels.",
  "frontend/src/lib/domainLabels.ts": "Maps domain enums to Italian labels and badge variants using the i18n utility.",
  "frontend/src/lib/i18n/index.ts": "Implements a simple i18n lookup with interpolation and exports the Italian dictionary.",
  "frontend/src/lib/i18n/it.ts": "Contains the full Italian translation dictionary for UI strings.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging and formatting dates in Italian using date-fns.",
  "frontend/src/main.tsx": "Bootstraps the app with React, InternetIdentityProvider, React Query, and global CSS.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with personal/admin views, tabs, and user-specific data loaded via hooks.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login page with Internet Identity login, optional invite alert, and feature highlights.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the attendance-management dApp, including schema version, high-level summary, and a list of existing implemented features with IDs and descriptions."
}