{
  "backend/main.mo": "Main actor implementing attendance management system with access control, user profiles, attendance records, holiday/permission requests, and invite link functionality with role-based authorization.",
  "backend/migration.mo": "Migration module defining old and new actor state types for data persistence across canister upgrades, currently implementing a no-op migration that preserves all existing state.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: admin invite links, user name display in team overview, and invite link creation timestamps with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, dashboard, profile management, attendance tracking, holiday/permission systems, and admin interfaces with Italian localization.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication state, invite code detection, profile setup flow, onboarding wizard, and conditional rendering of login/dashboard with theme provider.",
  "frontend/src/components/Header.tsx": "Application header component with theme toggle, user menu, logout functionality, and optional admin mode visual indicator with badge and accent styling.",
  "frontend/src/components/HolidayApprovals.tsx": "Admin component for viewing and managing holiday requests with approve/reject actions, filtering by status (pending/processed), and displaying summary statistics. Uses React Query hooks for data fetching and mutations.",
  "frontend/src/components/InviteManagement.tsx": "Admin component for generating and managing team invite codes with role selection (user/admin), displaying unused/used codes, and tracking RSVPs. Provides copy-to-clipboard functionality for invite links.",
  "frontend/src/components/MyAttendance.tsx": "User component for recording and managing personal attendance records with support for different activity types (project/service/generic/weekend/workshops), time tracking with breaks, and calendar views (day/week/month). Includes edit and delete functionality with date constraints starting from January 2025.",
  "frontend/src/components/MyHolidays.tsx": "User component for submitting holiday requests and viewing personal holiday history with monthly calendar navigation. Displays remaining holiday balance and filters requests by selected month.",
  "frontend/src/components/MyPermissions.tsx": "User component for submitting permission requests with type selection (generic/medical/family emergency) and date range picker. Displays request history with status badges and counts pending/approved requests.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi-step onboarding flow component that guides new users through RSVP submission, profile creation (name, position, employee status), and displays completion status with optional admin role notification.",
  "frontend/src/components/PermissionApprovals.tsx": "Admin component for reviewing and managing permission requests with filtering (pending/processed/all), displaying request details in a table, and providing approve/reject actions with status badges.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup that collects name, position, and role (admin/employee) with a default holiday balance of 20 days, preventing dismissal until completed.",
  "frontend/src/components/TeamOverview.tsx": "Comprehensive team attendance dashboard with day/week/month views, statistics cards, user attendance tables with profile lookups, date navigation, and CSV export functionality for attendance and holiday data.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, attendance records, holidays, permissions, RSVPs, and invite codes. Includes hooks for admin checks, role queries, and multi-user profile fetching with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, primary/secondary colors, charts, and sidebar components.",
  "frontend/src/lib/attendanceLabels.ts": "Backward-compatibility wrapper that delegates attendance status and activity type label functions to the centralized domainLabels module. Marks functions as deprecated.",
  "frontend/src/lib/domainLabels.ts": "Centralized domain label mappings providing Italian translations for attendance statuses, activity types, request statuses, permission types, and user roles using the i18n system.",
  "frontend/src/lib/i18n/index.ts": "Simple i18n utility providing type-safe access to Italian translation strings with dot-notation paths and parameter interpolation support.",
  "frontend/src/lib/i18n/it.ts": "Italian localization dictionary containing all UI strings for the application including common actions, time periods, authentication, roles, navigation, attendance statuses, and form labels.",
  "frontend/src/lib/utils.ts": "Utility functions including Tailwind class merging (cn) and multiple date formatting functions for converting nanosecond timestamps to Italian-formatted date strings in various formats.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM root.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with personal/admin view modes, displaying tabs for attendance, holidays, permissions, team overview, and approvals. Includes view mode persistence and admin-only access guards.",
  "frontend/src/pages/LoginPage.tsx": "React component that renders a login page with Internet Identity authentication, supporting optional invite codes and displaying features in a card-based layout with internationalization support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme properties including sidebar colors, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state metadata tracking three feature requests: admin role invite links, displaying user names in team overview for compliance, and showing invite link creation timestamps."
}