{
  "backend/main.mo": "Main Motoko actor implementing attendance management system with access control, user profiles, attendance records, holiday/permission requests, invite codes, and RSVP functionality with role-based authorization.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: displaying employee full names instead of codes in HolidayApprovals and PermissionApprovals components.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files describing their functionality, Italian localization, and key features.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, invite code detection, profile setup, onboarding, and dashboard routing with theme provider and loading states.",
  "frontend/src/components/Header.tsx": "Application header component with theme toggle, user menu, logout functionality, and optional admin mode indicator with badge and accent styling.",
  "frontend/src/components/HolidayApprovals.tsx": "Admin interface for approving/rejecting holiday requests with filtering (pending/processed/all), statistics cards, and employee name display via useGetMultipleUserProfiles hook.",
  "frontend/src/components/InviteManagement.tsx": "Admin interface for generating role-specific invite codes (user/admin), viewing available/used codes with timestamps, copying invite links, and managing team member onboarding.",
  "frontend/src/components/MyAttendance.tsx": "Component for users to record, view, edit, and delete their own attendance records with day/week/month views, time tracking, activity types (project, service, generic, weekend, workshops), and status management.",
  "frontend/src/components/MyHolidays.tsx": "Component for users to submit holiday/vacation requests, view their holiday balance, and track request status (pending/approved/rejected) with monthly calendar navigation.",
  "frontend/src/components/MyPermissions.tsx": "Component for users to submit permission requests with date ranges, reasons, and types (generic, medical, family emergency), and view their request history with approval status.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi-step onboarding wizard that accepts an invite code, collects user profile information (name, position, employee status), submits RSVP, and checks for admin role assignment.",
  "frontend/src/components/PermissionApprovals.tsx": "Admin component to view all permission requests with filtering (all/pending/processed), display user names from profiles, and approve or reject requests.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup, allowing users to select their role (admin/employee), enter name and position, and save profile with a default holiday balance of 20 days.",
  "frontend/src/components/TeamOverview.tsx": "Dashboard component displaying team attendance data with day/week/month views, statistics (present/remote/absent counts, hours worked), user profile lookups, and CSV export functionality for attendance and holiday requests.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend data operations including user profiles, attendance records, holiday requests, permission requests, invite codes, RSVPs, and CSV exports with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for UI components including sidebar, charts, and semantic colors.",
  "frontend/src/lib/attendanceLabels.ts": "Backward-compatibility wrapper that delegates attendance status and activity type label/badge variant functions to the centralized domainLabels module.",
  "frontend/src/lib/domainLabels.ts": "Provides centralized functions to map backend domain enums (AttendanceStatus, ActivityType, UserRole, etc.) to Italian labels and badge variants for consistent UI display.",
  "frontend/src/lib/i18n/index.ts": "Simple i18n utility that provides a type-safe `t()` function for accessing Italian translations via dot-notation keys with optional parameter interpolation.",
  "frontend/src/lib/i18n/it.ts": "Italian localization dictionary containing all UI strings organized by domain (common, auth, nav, attendanceStatus, etc.) as the single source of truth for translations.",
  "frontend/src/lib/utils.ts": "Utility functions including `cn()` for merging Tailwind classes and multiple date formatting helpers that convert nanosecond timestamps to Italian-localized date strings.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrapping the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with personal/admin view toggle, displaying tabs for attendance, holidays, permissions, team overview, and approvals based on user role and selected mode.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that displays Internet Identity authentication button, optional invite code alert, hero image, and feature cards describing the attendance system.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, container settings, border radius variables, animations, and plugin integrations for typography and animations.",
  "project_state.json": "Project state tracking implementation of employee name display in holiday and permission approval views, replacing employee codes with full names. Contains two completed features (REQ-1, REQ-2) and two pending feature requests (AR-1, AR-4) for the HR/leave management system."
}