{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Display employee names instead of codes in approval views",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display employee full names in the holiday approvals view instead of employee codes",
      "acceptanceCriteria": [
        "The holiday approvals table shows employee names in a dedicated column",
        "Employee codes are no longer displayed as the primary identifier",
        "The employee name is retrieved from the user profile using the userId associated with each request"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HolidayApprovals.tsx",
          "operation": "modify",
          "description": "Replace employee code display with employee full name by fetching user profiles using the useMultipleProfiles hook. Extract all unique user principals from the holiday requests array, pass them to useMultipleProfiles to fetch their profiles, then display the profile name in the table column where the principal string was previously shown. Handle loading states while profiles are being fetched and display a fallback (e.g., 'Loading...' or the principal) if a profile is unavailable."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Display employee full names in the permission approvals view instead of employee codes",
      "acceptanceCriteria": [
        "The permission approvals table shows employee names in a dedicated column",
        "Employee codes are no longer displayed as the primary identifier",
        "The employee name is retrieved from the user profile using the userId associated with each request"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PermissionApprovals.tsx",
          "operation": "modify",
          "description": "Replace employee code display with employee full name by fetching user profiles using the useMultipleProfiles hook. Extract all unique user principals from the permission requests array, pass them to useMultipleProfiles to fetch their profiles, then display the profile name in the table column where the principal string was previously shown. Handle loading states while profiles are being fetched and display a fallback (e.g., 'Loading...' or the principal) if a profile is unavailable."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure efficient user profile fetching for approval views using the existing useMultipleProfiles hook",
      "acceptanceCriteria": [
        "User profiles are fetched efficiently using the existing useMultipleProfiles hook",
        "Names are displayed even when viewing large lists of requests",
        "Loading states are handled gracefully while profile data is being fetched"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and ensure the useMultipleProfiles hook implementation is optimized for fetching multiple user profiles efficiently. Verify that the hook accepts an array of principals, batches the requests appropriately, handles loading states correctly, and returns a map or object structure that allows easy lookup of profiles by principal. If the hook does not exist, create it following the existing query hook patterns with proper React Query configuration for caching and deduplication."
        }
      ]
    }
  ]
}